receipeData1 = '[{"receipeId" : 1, "large_image":"Receipe1.jpg", "small_image":"", "title" : "Chocolate Chips Cookies", "Facts": ["Total Time: 18 minutes","Yield: 24-28 cookies","Diet: Vegetarian"], "Ingredients": ["1 cup unsalted butter, softened to room temperature","1 cup light brown sugar, packed","¾ cup granulated sugar","2 large eggs","2 teaspoons vanilla extract","3 cups all-purpose flour","1 teaspoon baking soda","½ teaspoon salt","1 cup chocolate chips (plus a little more for the top)"], "Instructions":["Preheat oven to 350F. Line a large half sheet baking tray with a silicone baking mat or parchment paper and set aside.","In a large mixing bowl, use a hand mixer or stand mixer cream together butter and sugars on medium speed until light and fluffy, about 2 minutes.","Add egg and vanilla, and beat on low until incorporated. Add flour, baking soda, and salt and beat until just combined. Fold in the chocolate chips.","Use a medium cookie scoop to scoop out 2 tablespoons of cookie dough. Use your hands to roll it into a ball (this will ensure cookies with smooth edges). Place the cookie balls onto the lined baking sheet, spaced at least 2 inches apart (you can fit about 6-8 on a large cookie sheet). If you don\'t care to have smooth edges, you can just drop the cookie dough onto the baking sheet without smoothing it into a ball.","Bake for 8-10 minutes, until edges just start to brown. DO NOT OVERBAKE. The cookies may not look done in the middle, but they will continue to cook as they are cooling. Remove from oven and allow the cookies to cool in the baking sheet for 5 minutes, then carefully press in some extra chocolate chips into the top of the cookies (if desired), and transfer to a wire cooling rack to cool completely." ]}, {"receipeId" : 2, "large image":"", "small image":"", "title" : "Banana Nut Bread", "Facts": ["Total Time: 1 hour 25 minutes","Yield: 1 loaf"], "Ingredients": ["1 teaspoon baking soda","1 teaspoon baking powder","¼ teaspoon salt","⅓ cup unsalted butter, melted","½ cup brown sugar","2 eggs","5 ripe bananas","⅓ cup walnuts, crushed"], "Instructions":["Preheat oven to 350 F. Line a standard loaf pan with parchment paper, then grease with baking spray.","Soak raisins and apricots (optional) in a bowl of water for 15-30 mins. Drain.","In a large bowl, combine flour, baking soda, baking powder, and salt, and stir together. Set aside.","In a medium bowl, beat butter and brown sugar together using a hand mixer on medium high speed until smooth and creamy, about 2 minutes. Add eggs, one at a time, continuously beating until incorporated. Set aside.","In a large bowl, add bananas and mash using a fork. Pour egg mixture into bananas. Beat on medium high speed for 2-3 minutes, until fully blended and smooth. Add the crushed walnuts, soaked raisins and dried apricots. Beat until combined.","Pour the wet mixture into flour mixture and mix together using a spatula until just combined. Let the batter sit for 3 minutes.","Pour the batter into the prepared loaf pan and bake for 65 minutes, or until a toothpick inserted into the center of the cake comes out with few to no crumbs. Let cool 10-15 minutes, then invert to remove loaf. Serve warm or at room temperature.","To store, and once cool, cover banana bread with plastic wrap to retain moisture."]}, {"receipeId" : 3, "large image":"", "small image":"", "title" : "Molten Chocolate Lava Cakes", "Facts": ["Total Time: 22 minutes","Yield: 4 cakes", "Diet: vegetarian"], "Ingredients": ["6 oz. semi-sweet chocolate (or 1 cup chocolate chips), coarsely chopped","½ cup unsalted butter, cut into ½ inch cubes","2 large eggs","2 large egg yolks","½ teaspoon vanilla extract","¼ cup confectioners sugar","⅛ teaspoon salt","3 tablespoons all-purpose flour"], "Instructions":["Preheat oven to 425 F. Grease four 6-oz. ramekins or three 8-oz. ramekins with non-stick cooking spray and dust with cocoa powder, tapping out the excess cocoa powder. This will help the lava cakes come out easily when inverted.","Melt the chocolate and butter in a medium heat-proof bowl and set aside to allow it to slightly cool. You can melt the chocolate either on the stove or in the microwave.","On the stove: Bring 2 inches of water to a low simmer in a saucepan over medium-low heat. Then turn the heat to low and place medium heatproof bowl of chocolate with butter on the mouth of the pot. Make sure that there is a gap of a few inches in between the bottom of the bowl and the water (You can also place a bowl on a steamer attachment on top of your pot). Stir the chocolate constantly as it melts. Stir until the chocolate is completely smooth and melted. This should take a few minutes.","In the microwave: The second way to melt chocolate (and an easier way) is in the microwave. Place the medium heatproof bowl of chocolate and butter into the microwave and microwave in 20 second intervals. Remove the bowl at each interval and stir well. Repeat until the chocolate has completely melted. Stir until completely smooth.","In a medium mixing bowl, use an electric hand mixer or a whisk to beat together the eggs, egg yolks, vanilla extract, sugar, and salt, on low speed, until combined, about 1 minute.","Pour in the melted chocolate into the egg mixture, along with the flour. Use a rubber spatula and fold it in until fully combined. Note that the batter will be thick but should not be lumpy.","Place the ramekins on a quarter sheet baking pan and divide the batter between them. Bake for 12-14 minutes until the edges look solid and firm. The tops will still be soft with a slight jiggle in the center. Do not overcook as overcooking will cause the center to completely solidify and not be gooey. If you are not sure how hot your oven runs,  I suggest making one first to test. If it has solidified too much, then adjust the bake time lower. Mine turns out perfect at exactly 12 minutes.","Allow the cakes to cool in the ramekins for 1 minute, then cover each with an inverted plate and use an oven mitt to flip them over and release the cakes onto the plate.","Add toppings (such as a scoop of vanilla ice cream, dusting with powdered sugar, garnishing with fresh  fruit, or a drizzle of salted caramel sauce or chocolate sauce). Serve immediately."]}]';