receipeData8 = '[{"receipeId" : 8, "large_image":"Receipe8.jpg", "small_image":"", "title" : "Classic New York Cheesecake", "Facts": ["Total Time: 5 minutes","Yield: one 8-inch cheesecake"], "Ingredients": ["2 cups Graham-style crumbs","1 tablespoon white sugar","3 tablespoons butter, melted","24 oz. (or three 8 oz. blocks) cream cheese, at room temperature","½ cup plain Greek yogurt, at room temperature","4 large eggs","½ cup white sugar","1 teaspoon vanilla extract","homemade strawberry sauce, for serving"], "Instructions":["Make the cheesecake crust: Preheat oven to 350 F. In a medium bowl, stir crumbs and sugar together. Gradually pour in melted butter, continuing to stir until well mixed. Press crumbs firmly into a 8” x 8” springform pan. Bake crust for 10 minutes. Allow crust to cool for approximately one hour before filling.","Make the cheesecake filling: In a large bowl, use a mixer to mix cream cheese, yogurt, sugar and vanilla extract together until well blended. Add eggs, one at a time, and beat until just blended. Repeat until all eggs are added and blended (Do not overmix to avoid cracking during baking).","Assemble and bake: Preheat oven to 350 F. Pour filling into the cooled crust and smooth out the surface. Wrap the outside of the springform pan tightly with foil and place the pan in a large baking dish. Fill the dish with 1 inch (2 cm) deep of boiling water. Move the baking dish to the oven and bake for 1 hour in the boiling water bath (This helps prevent sudden temperature drop and cracking).","After an hour, turn off the heat and leave the cheesecake in the oven for an hour, allowing it to continue baking slowly.","Take the pan out of the oven and run a paring knife gently around the outside of the cheesecake to loosen it from the sides of the pan. Cover the pan with plastic wrap and transfer to the refrigerator overnight (or for at least 8 hours) to cool down and solidify.","To serve, remove the sides of the springform pan and transfer the cheesecake to a serving dish. Cut into slices and serve with homemade strawberry sauce on top."]}]'