receipeData4 = '[{"receipeId" : 4, "large_image":"Receipe4.jpg", "small_image":"", "title" : "Chocolate and Vanilla Marble Cake", "Facts": ["Total Time: 1.35 hours","Yield: 12 slices", "Diet: vegetarian"], "Ingredients": ["2 cups all-purpose flour (340 grams)","1 + ¼ teaspoons baking powder","½ teaspoon baking soda","¼ teaspoon salt","4 ounces semi-sweet chocolate, coarsely chopped","¾ cup unsalted butter, softened","1 + ¼ cup granulated sugar", "3 large eggs", "2 teaspoons vanilla extract", "¾ cup milk (or buttermilk)"], "Instructions":["Preheat oven to 350ºF. Spray a 1.5 lb. loaf pan with cooking spray and line it with parchment paper, leaving an overhang on the sides. Set aside.","In a medium mixing bowl, sift together flour, baking powder, baking soda, and salt. Set aside.","Melt the chocolate in a small bowl. You can melt it by placing the bowl on a steamer basket, over a small pot of boiling water, or melt in the microwave in 30 second increments, stirring between each increment until melted and smooth. Set aside.","In a large mixing bowl, use a hand mixer (or stand mixer) to beat the butter and sugar together until light and fluffy, about 2 minutes. Add eggs, one at a time, and beat until each is incorporated. Add vanilla extract and beat until incorporated.","Turn the mixer to low speed and add half the flour mixture, and beat until combined. Add the milk and beat until combined. Finally add the remaining flour, and beat until combined.","Remove 2 cups of the cake batter and transfer to another bowl. Stir in the melted chocolate.","Use a large spoon and drop alternating dollops of vanilla and chocolate batter into the prepared loaf pan in a checkerboard pattern. After you have completed one layer, use a toothpick or skewer to lightly swirl into each other.","Repeat with alternating dollops until you have used up all the batter. Take a toothpick and do a final swirl to create the marble effect, but be careful not to overdo it. Just a few swirls will do the trick.","Bake for 1 hour 20 minutes, or when the tops are golden brown and a toothpick inserted into the center comes out clean.","Allow the cake to chill in the pan for 15 minutes, then use the parchment paper overhang to lift it from the pan and place onto a wire cooling rack to cool completely."]}]';